- film tablosunda bulunan tüm sütunlardaki verileri replacement cost değeri 12.99 dan büyük eşit ve 16.99 küçük olma koşuluyla sıralayınız ( BETWEEN - AND yapısını kullanınız.)

In [7]:
SELECT *
FROM film
WHERE replacement_cost BETWEEN 12.99 AND 16.98

- actor tablosunda bulunan first\_name ve last\_name sütunlardaki verileri first\_name 'Penelope' veya 'Nick' veya 'Ed' değerleri olması koşuluyla sıralayınız. ( IN operatörünü kullanınız.)

In [6]:
SELECT first_name , last_name 
FROM actor 
WHERE first_name IN('Penelope', 'Nick', 'Ed');

- film tablosunda bulunan tüm sütunlardaki verileri rental\_rate 0.99, 2.99, 4.99 VE replacement\_cost 12.99, 15.99, 28.99 olma koşullarıyla sıralayınız. ( IN operatörünü kullanınız.)

In [8]:
SELECT * 
FROM film 
WHERE rental_rate IN (0.99, 2.99, 4.99) AND replacement_cost IN (12.99, 15.99, 28.99)